[
    {
    "title": "Web Design",
    "description": "I have been programming for 10 years and teaching classes on the same topic for just as long. My expertise lies within Web Development though I know the fundamentals of Python. I am currently teaching myself React.JS, Node.JS and other associated topics.",
    "skills": [
      "HTML",
      "CSS",
      "JS",
      "React",
      "Bootstrap",
      "Git",
      "Command Line"
    ],
    "projects": [
      {
        "key": "PW",
        "title": "2023 Portfolio Website",
        "desc": "In 2023 I began to develop my portfolio website using React JS and various libraries like Framer Motion and Full Page JS. I initially designed the site's UI as a personal project while working for the Nimbus Research Institute. With a clear vision in mind, I aimed to create a site that showcased my diverse portfolio types. First and foremost, React JS served as the foundation of my website, enabling me to build a highly interactive and responsive user interface. Its component-based architecture facilitated modular development and enhanced code reusability, enabling me to create distinct sections for each portfolio type. To add some flair to my website, I turned to Framer Motion. This animation library allowed me to craft seamless transitions, hover effects, and page-scroll animations. Additionally, I integrated Full Page JS to introduce an intuitive navigation system, enabling users to effortlessly explore various portfolio types. With its smooth scrolling and full-screen sections, Full Page JS elevated the overall user experience. The goal is for this site to exemplify my skills as a Front-End Developer and I feel confident that it has done so.",
        "view": "https://github.com/KevinThePirate/2023PortfolioSiteNext",
        "imgSrc": "https://i.imgur.com/9NeLiJQ.png"
      },
      {
        "key": "FYMP",
        "title": "Observo",
        "desc": "For my final year project in Creative Digital Media, I developed a React application that aimed to explore the correlation between habits and mood. This project served as my thesis for my undergraduate degree and was the most ambitious project I have worked on to date.  Leveraging the power of React, I crafted a user-friendly interface that allowed users to log in and seamlessly track their habits and mood over time. By integrating a Firebase backend, I ensured that user data was securely stored and easily accessible. The application enabled users to input their daily habits and record their mood, and then provided visualizations and analysis to showcase any potential connections between the two. This unique approach to understanding the impact of habits on mood resonated with both users and my academic evaluators. I am proud to share that my project received the highest grade in my graduating class. This recognition not only validated my hard work and dedication but also highlighted the potential of utilizing React and Firebase to develop insightful and impactful applications.",
        "view": "https://final-year-project-version-b.vercel.app/",
        "imgSrc": "https://i.imgur.com/eAfZAWV.png"
      },
      {
        "key": "MM",
        "title": "Maths Masters",
        "desc": "In my front-end development classes at CIT, I created an educational game called Maths Masters using Vanilla JS. This game, styled after the Pokemon franchise, aimed to make learning mathematics a fun and engaging experience for kids. Maths Masters featured four levels of increasing difficulty, each presenting a series of math problems to solve. To enhance the user experience, I incorporated animations and visually appealing graphics inspired by the Pokemon world. The game included a leaderboard feature to foster a sense of competition and allow players to compare their scores. I am proud to say that my lecturer graded Maths Masters with an impressive 94%.",
        "view": "https://kevinthepirate.github.io/MathsMasters/",
        "imgSrc": "https://i.imgur.com/jnRe3bp.png"
      },
      {
        "key": "RTDA",
        "title": "React To-Do App",
        "desc": "I built a Weather App using React JS that utilizes an API call to retrieve real-time weather data. This app provided users with up-to-date weather information for any location they desired. By leveraging React JS, I created a dynamic and responsive user interface that allowed seamless interaction and data display. The API call enabled the app to fetch weather data, including temperature, humidity, wind speed, and conditions, providing users with accurate and relevant information. This project showcased my ability to integrate external data sources and deliver a functional and user-friendly application that enhanced the user's experience in staying informed about the weather.",
        "view": "https://github.com/KevinThePirate/React-To-Do-App",
        "imgSrc": "https://i.imgur.com/4T6zdjZ.png"
      }
    ]
  }
]
